app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-11-06 23:38:45.021811"], ["updated_at", "2019-11-06 23:38:45.021811"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 3], ["cart_id", 1], ["created_at", "2019-11-11 08:49:47.898178"], ["updated_at", "2019-11-11 08:49:47.898178"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2019-11-07 02:04:08.174560"], ["id", 21]]
---
  def create
    product   = Product.find( params[:product_id] )
    @line_item = @cart.add_product( product );

    respond_to do |format|
      if @line_item.save