app/controllers/orders_controller.rb

  def create

    params = order_params
    detail_params =  pay_type_params.to_h
    params[:payment_detail_attributes] = detail_params
    params[:payment_detail_type] = order_params[:pay_type].delete(' ').classify

    @order = Order.new( params );
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy( session[:cart_id] )
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-11-06 23:38:45.583993"], ["updated_at", "2019-11-06 23:38:45.583993"]]
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at", "payment_detail_id", "payment_detail_type") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 5]]

    def ensure_cart_isnt_empty
      if @cart.line_items.empty?
---
SELECT  1 AS one FROM "line_items" WHERE "line_items"."cart_id" = $1 LIMIT $2  [["cart_id", 5], ["LIMIT", 1]]