app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "description", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["description", ""], ["image_url", ""], ["created_at", "2019-11-05 04:38:23.681445"], ["updated_at", "2019-11-05 04:38:23.681445"]]