app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "name" ASC
---
  def index
    @users = User.order(:name)

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save