app/models/order.rb

  def add_line_items_from_cart( cart )
    cart.line_items.each do |item|
      item.cart_id = nil
      line_items << item
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = $1  [["cart_id", 3]]
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at", "payment_detail_id", "payment_detail_type") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"