app/models/user.rb

SELECT COUNT(*) FROM "users"
---
    def ensure_an_admin_remains
      if User.count.zero?