app/controllers/concerns/current_cart.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-11-11 08:33:27.841300"], ["updated_at", "2019-11-11 08:33:27.841300"]]
---
    def set_cart
      @cart = Cart.find( session[:cart_id] )
    rescue ActiveRecord::RecordNotFound
      @cart  = Cart.create